type #ამბობს რომ ტაიპი არის ინტეჯერი მაგ..
balance = 300 #და თუ ბრჭყალებში ჩავსვავთ 300სს მაშინ ტერმინალში სტრინგს დაწერს
print(type(balance))
float #მაგ.. 4/2

int and str #შეიძლება მხოლოდ გამრავლება


print("🍔🍔✅\n" * 10)

math_operators # + // % - / * **
comperators # > <  = == !------საბოლოოდ გამოაქვს boolean  type სია
# >
# <
# >=
# <=
# == უდრის
# != არ უდრის 
print(1 >= 2) #ამ შემთხვევაში ტერმინალში დაწერს trueს რადგან პრინტსი წერია მეტია ან ტოლია


data_types   #boolean , int ,float , str
bool #True / False

print( int(True), int(False))


print(2 >= 2)
print(2 <= 2)
print(2 < 4)
print(2 == 2) # 2 ტოლია ორის 



binary_codes # არი 0 და 1

logical_operators #შეუძლიათ შეადაროს ლოგიკური ოპერატორები საბოლოოდ კი განსაზღვრავს bolean type-ს
# and - და
# or - ან 
# not - არა

print(True and False and True)
print(True and True) # True
# თუ სადმე არის და-ში False მაშინ ეს მოქმედება არის False
print(True and False) # False
print(False and False) # False
print(1 and 2 )# False 
# and არის აუცილებელი პირობა
#---------------------------------------------------------------
# or არ არის აუცილებელი პირობა 
#Fals rom mivigod and da True rom mivigod or