
case_sensitive #როდესაც მნიშვნელობა ენიჭება დიდ და პატარა ასოებს მაგ..
score = 6
print(Score) #არასწორია 
print(score) #sworia

snake_case #არ შეიძლება ცვლადის სახელში სფეისის გამოყენება და ვიყენებთ _ ქვედა ტირეს ,მაგ..
dog_name = "bob"

#ცვლადები არ იწყება რიცხვებით


output
print # არის output-ის მაგალითი
#output გამოაქვს რაღაც ეკრანზე, გამოსცემს ხმას ,მაგ..
#დინამიკი, კომპ  ეკრანი

input
#არის ინფორმაცია რომელიც კომპიუტერში შედის მაგ..
#ღილაკზე ხელის დაჭერა, მიკროფონში რაღაცის თქმა
#input არის ფუნქცია რადგან ფრჩხილები მოყვება 
input #მაგალითები
name = input("enter your name: ")
print("hello", name) #ამის გაშვების შემდეგ ტერმინალში ვწერთ სახელს
age = input()


stringebi #(concatination) #ერთდებიან 
intejerebi #იკრიბებიან


