print("გამარჯობა სამყარო")
#პრინტი არის ფუნქცია
#ფუნქციას ყოველთვის აქვს გამხსნელი და დამხურვი ფრჩხილები ()
#ყველა ფუნქციას აქვს დანიშნულება
#print() დანიშნულება არის რომ ტერმინალში გამოიტანოს მნიშვნელობები
#
#parentheses -ფრჩხილები
# data types
 #მონაცემთა ტიპები პითონში /14--15


# ტექსტუალური მონაცემები / string -- ბრჭყალებში მოთავსებული ტექსტი  ""

#ციფრული მონაცემები   integer , float, imagenari number


#int  ------ 1--2--3--4--5--6--7--8---9--10
#float  ------ 1,4---1,5 --  33,55
#imaginary number 3+5---
#ციფრებს შეუძლიათ მათემატიკური ოპერაციების განსაზღვრა
print (1+4)

 
 
 #string vs numeric numbers ------str არ ემატება numeric numbers
print("გოას"  +  str(12.2)) # არ შეიძლება
 
 
 #ცვლადი --- variable
# ცვლადები ინახავენ  მნიშვნელობებს
 
 #ლოგიკური სახელები შევუსაბამოთ
name = "satvale"
number = 1
sentence = 'datvi chams vashls'
 
 

#სადაც გამოვიძახებთ  /  დავწერთ ცვლადის სახელს ყველგან გამოვა მინის მნიშვნელობა ანუ რასაც იმახსოვრებს ეს ცვლადი


# ცვლადი ინახავს მნიშვნელობას
# ცვლადის სახელი, =-ით ხდება მნიშვნელობის მინიჭება, მნიშვნელობა
# = დეკლარაცია = ხდება მნიშვნელობის მინიჭება,
#ცვლადის სახელი ,დეკლარაცია, ცვლადს ენიჭება მნიშვნელობა
country = "საქართველოო"

 
 #ბრჭყალების გარეშე რასაც დავწერთ ყველაფერი არის ცვლადის სახელი
 
 #ცვლადებში იწერება მნიშვნწლოვანი ინფორმაცია
 
 
 #დავითას თამაში
player = 14
 
print(player-1)

 
 
name = "satvale"
 
print("-------------------------")
print(name)


# სტანდარტული ვერსია პითონის ცვლადების 
# ჩაწერისას  snake_case,  camelCase --- js ში
# რა არ შეიძლება ცვლადის შექმნის დროს -- პირველი ასო უნდა იყოს პატარათი 
# დაწერი  p არა p ..---- #
# არ ვიწყებთ 1123 ციფრებით_ მოსულა




















